TOKEN = "6658779682:AAETvgZ4xut0-7408-OwXja9oC4xi2vEdJs"

INTRO = "👋 Привет! Я помогу тебе быть в курсе всех событий: выбери в меню что мне нужно сделать!"
ERROR = "❌ Не понимаю твой запрос: используй меню"

SEARCH = "🔎 Обработка запроса..."
ENTER_TYPE = "✍️ Введи интересующую тебя тему (например: наука, медицина, политика)"
ENTER_ERROR = "❌ Не знаю такую тему"
ENTER_NOT_FOUND = "❌ Актуальных новостей на запрошенную тему не найдено"

LIST_NOTIFICATIONS = "Список текущих оповещений:\n"
CREATE_NOTIFICATION = "Создать оповещение: \n"

BUTTON_MAIN = "Главное меню"
BUTTON_LIST_NEWS = "📰 Последние новости"
BUTTON_LIST_NOTIFICATION = "🔉 Текущие оповещения"
BUTTON_CREATE_NOTIFICATION = "✅ Создать оповещение"

BUTTON_MAIN_LIST = [
    BUTTON_LIST_NEWS,
    BUTTON_LIST_NOTIFICATION,
    BUTTON_CREATE_NOTIFICATION,
]